export type TAgreementInfo = {
  heading: string;
  description?: string;
  pointedList?: string[];
  pointedWithDashed?: string[][];
  id: number;
};

// export const agreementInfo: TAgreementInfo[] = [
//   {
//     heading: 'Права и обязанности сторон',
//     pointedWithDashed: [
//       [
//         'Пользователь имеет право:',
//         'осуществлять поиск информации на сайте',
//         'получать информацию на сайте',
//         'создавать информацию для сайта',
//         'распространять информацию на сайте',
//         'комментировать контент, выложенный на сайте',
//         'требовать от администрации скрытия любой информации о пользователе',
//         'использовать информацию сайта в личных некоммерческих целях',
//         'использовать информацию сайта в коммерческих целях с разрешения Администрации',
//         'использовать информацию сайта в коммерческих целях с разрешения правообладателей',
//         'использовать информацию сайта в коммерческих целях без специального разрешения',
//       ],
//       [
//         'Администрация имеет право:',
//         'по своему усмотрению и необходимости создавать, изменять, отменять правила',
//         'ограничивать доступ к любой информации на сайте',
//         'создавать, изменять, удалять информацию',
//         'удалять учетные записи',
//         'отказывать в регистрации без объяснения причин',
//       ],
//       [
//         'Пользователь обязуется:',
//         'обеспечить достоверность предоставляемой информации',
//         'обеспечивать сохранность личных данных от доступа третьих лиц',
//         'обновлять Персональные данные, предоставленные при регистрации, в случае их изменения',
//         'не нарушать работоспособность сайта',
//         'не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с Сайтом и его Сервисами',
//       ],
//       [
//         'Администрация обязуется:',
//         'поддерживать работоспособность сайта за исключением случаев, когда это невозможно по независящим от Администрации причинам.',
//       ],
//     ],
//     id: 1,
//   },
//   {
//     heading: 'Ответственность сторон',
//     pointedList: [
//       'пользователь лично несет полную ответственность за распространяемую им информацию',
//       'администрация не несет никакой ответственности за достоверность информации, скопированной из других источников',
//       'администрация не несёт ответственность за несовпадение ожидаемых Пользователем и реально полученных услуг',
//       'администрация не несет никакой ответственности за услуги, предоставляемые третьими лицами',
//       'в случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную работу информационного ресурса',
//     ],
//     id: 2,
//   },
//   {
//     heading: 'Условия действия Соглашения',
//     description:
//       'Данное Соглашение вступает в силу при любом использовании данного сайта. Соглашение перестает действовать при появлении его новой версии. Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему усмотрению. Администрация не оповещает пользователей об изменении в Соглашении.',
//     id: 3,
//   },
// ];

// export const agreementInfo: TAgreementInfo[] = [
//   {
//     heading: 'AGREEMENT_RIGHTS_HEADING',
//     pointedWithDashed: 'AGREEMENT_RIGHTS_LIST',
//     id: 1,
//   },
//   {
//     heading: 'AGREEMENT_LIABILITY_HEADING',
//     pointedList: 'AGREEMENT_LIABILITY_LIST',
//     id: 2,
//   },
//   {
//     heading: 'AGREEMENT_TERMS_HEADING',
//     description: 'AGREEMENT_TERMS_DESCRIPTION',
//     id: 3,
//   },
// ];
